#1
#SyntaxError: ეს ხდება, როდესაც კოდის სინტაქსი არასწორია, მაგალითად, ქულის ან ფრჩხილის გაშვება.
#ValueError: მაშინ ხდება, როდესაც ფუნქცია არასწორ ტიპის ან არასწორ მნიშვნელობას იღებს.
#IndexError: ხდება, როდესაც სიაში ან სხვა ინდექსირებულ ობიექტში არასწორ ინდექსზე წვდომას ვცდილობთ.
#TypeError: ხდება, როდესაც ოპერაცია არასწორ ტიპზე ვცდილობთ.
#NameError: ხდება, როდესაც ცვლადს ან ფუნქციას მივმართავთ, რომელიც არ არის განსაზღვრული

#2
try:
    print(unknown_variable)  # NameError: ეს ცვლადი არ არსებობს.
except NameError:
    print("NameError: Variable not defined.")

#3
lst = [1, 2, 3]
try:
    print(lst[5])  # IndexError: ინდექსი 5 არ არსებობს.
except IndexError:
    print("IndexError: Wrong index.")

#4

try:
    num = int("abc")  # ValueError: სტრინგს ნომრად ვერ გადავაქცევთ
except ValueError:
    print("ValueError: მოცემული მნიშვნელობა არასწორია.")

#5
#პროგრამის უწყვეტი მუშაობა: როდესაც შეცდომა ხდება, try/except პროგრამას აძლევს საშუალებას გააგრძელოს მუშაობა შეცდომის შემდეგ.
#ცნობადი შეცდომების მართვა: try/except-ით შესაძლებელი ხდება კონკრეტული შეცდომის იდენტიფიცირება და დამუშავება.
#დამხმარე შეტყობინებები: შეცდომისას დეტალური შეტყობინებების გამოჩენით პროგრამის გაუმჯობესება.
#უსაფრთხოება: მჭიდრო კონტროლი შეცდომებზე პროგრამის უსაფრთხოების გაუმჯობესებისთვის.